{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>X\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [27, 106, 3], "batch_input_shape": [null, 27, 106, 3], "function_type": "lambda", "arguments": {}, "name": "lambda_1", "input_dtype": "float32", "output_shape_type": "raw", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 12, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "bias": true, "name": "convolution2d_1", "trainable": true, "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"nb_filter": 18, "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "bias": true, "name": "convolution2d_2", "trainable": true, "nb_col": 3, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "nb_row": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_1", "trainable": true, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "input_dim": null, "output_dim": 50}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_2", "trainable": true, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "init": "glorot_uniform", "input_dim": null, "output_dim": 10}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "name": "dense_3", "trainable": true, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dim": null, "output_dim": 1}}], "keras_version": "1.1.2"}