{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "output_shape": [27, 106, 3], "batch_input_shape": [null, 27, 106, 3], "output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>X\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "activity_regularizer": null, "nb_filter": 24, "b_regularizer": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "bias": true, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_row": 5, "activation": "relu", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "activity_regularizer": null, "nb_filter": 36, "b_regularizer": null, "trainable": true, "nb_col": 3, "subsample": [2, 2], "bias": true, "W_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "activation": "relu", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "activation": "relu", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "activation": "relu", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "activation": "linear", "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}]}